# YOLOv8 Varroa compare baseline+P2+API box-gradient+pooling edge with box-aware IoU quality head.
# Quality predicts per-anchor localization tightness from feature maps plus DFL/box summary cues.

nc: 1
quality_head: true
quality_box_features: true
quality_box_detach: true
quality_loss: bce_balanced
quality_gain: 0.5
quality_neg_gain: 0.10
quality_pos_iou_thr: 0.5
quality_hard_neg_iou_thr: 0.3
quality_hard_neg_score_thr: 0.05
quality_target_mode: ap75_ramp
quality_ramp_low: 0.50
quality_ramp_high: 0.75
quality_neg_mode: hard
quality_score_mode: sqrt_cls_mul_q
quality_detach_target: true

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, PoolingEdgeRepC2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, RepC2f, [256, True]]    # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, RepC2f, [512, True]]    # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, RepC2f, [1024, True]]   # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]        # 9-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]          # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]] # 15-P3/8

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [128]] # 18-P2/4
  - [-1, 1, AdversarialPerturbationInjection, [0.005, 0.05, boxgrad, True]] # 19-P2 localization API (partial_forward=True)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]] # 22-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]          # 25-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, RepC2f, [1024]]         # 28-P5/32

  - [19, 1, EnSimAM, []]            # 29-P2 final
  - [22, 1, EnSimAM, []]            # 30-P3 final

  - [[29, 30, 25, 28], 1, Detect, [nc]]
