# Placement A – "Head Gate Only" (no ASF, no BiFPN)
# Standard PAN neck: Upsample + Concat + RepC2f (4-head P2/P3/P4/P5).
# KVCA gate (refactored kv_compress) trước Detect tại P2 (sr=8) và P3 (sr=4).
# Dùng làm ablation baseline.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, RepC2f, [256, True]]     # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, RepC2f, [512, True]]     # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, RepC2f, [1024, True]]    # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]         # 9-P5/32

head:
  # Top-down path: P5 → P4 → P3 → P2
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 10: P5 up
  - [[-1, 6], 1, Concat, [1]]                  # 11: cat P4 backbone
  - [-1, 3, RepC2f, [512, False]]              # 12-P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 13: P4 up
  - [[-1, 4], 1, Concat, [1]]                  # 14: cat P3 backbone
  - [-1, 3, RepC2f, [256, False]]              # 15-P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 16: P3 up
  - [[-1, 2], 1, Concat, [1]]                  # 17: cat P2 backbone
  - [-1, 3, RepC2f, [128, False]]              # 18-P2 output (top-down)

  # Bottom-up path: P2 → P3 → P4 → P5
  - [-1, 1, Conv, [128, 3, 2]]                 # 19: P2 down
  - [[-1, 15], 1, Concat, [1]]                 # 20: cat P3 top-down
  - [-1, 3, RepC2f, [256, False]]              # 21-P3 output

  - [-1, 1, Conv, [256, 3, 2]]                 # 22: P3 down
  - [[-1, 12], 1, Concat, [1]]                 # 23: cat P4 top-down
  - [-1, 3, RepC2f, [512, False]]              # 24-P4 output

  - [-1, 1, Conv, [512, 3, 2]]                 # 25: P4 down
  - [[-1, 9], 1, Concat, [1]]                  # 26: cat P5 backbone
  - [-1, 3, RepC2f, [1024, False]]             # 27-P5 output

  # KVCA head gate (refactored: AvgPool compress, Flash SDPA, attn_drop=0.1)
  - [18, 1, KVCompressedAttention, [128, 4, 8, dwconv, 0.1]]   # 28-P2 gate
  - [21, 1, KVCompressedAttention, [256, 4, 4, dwconv, 0.1]]   # 29-P3 gate

  - [[28, 29, 24, 27], 1, Detect, [nc]]
