# YOLOv8 Varroa TPH-style config: SPPF-level KVCA + EnSimAM global context,
# CBAM-enhanced PAN fusion, EnSimAM neck outputs, and KVCA encoder prediction heads for P2/P3/P4/P5.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]        # 9-P5/32
  - [-1, 1, KVCompressedAttention, [1024, 4, 2, dwconv]]  # 10-P5/32
  - [-1, 1, EnSimAM, []]            # 11-P5/32

head:
  # Top-down PAN path with CBAM-refined fusion blocks.
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [512, False]]  # 14-P4/16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [256, False]]  # 17-P3/8

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [128, False]]  # 20-P2/4

  # Bottom-up PAN path.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [256, False]]  # 23-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [512, False]]  # 26-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [1024, False]] # 29-P5/32

  # EnSimAM refinements on final neck outputs.
  - [20, 1, EnSimAM, []]
  - [23, 1, EnSimAM, []]
  - [26, 1, EnSimAM, []]
  - [29, 1, EnSimAM, []]

  # Transformer Prediction Head-style KVCA encoder refinements before Detect.
  - [30, 1, KVCompressedTransformerEncoder, [128, 4, 8, dwconv]]
  - [31, 1, KVCompressedTransformerEncoder, [256, 4, 4, dwconv]]
  - [32, 1, KVCompressedTransformerEncoder, [512, 4, 2, dwconv]]
  - [33, 1, KVCompressedTransformerEncoder, [1024, 4, 2, dwconv]]

  - [[34, 35, 36, 37], 1, Detect, [nc]]
