# YOLOv8 Varroa P2/P3 with box-only local detail head, loc assignment, and DFL residual.
# No DGFE and no API; this isolates the box branch detail adapter.

nc: 1
loc_assign: true
loc_assign_topk: 3
loc_assign_max_stride: 8.0
loc_assign_center_radius: 2.5
loc_assign_weight: 0.5
dfl_residual: true
dfl_residual_scale: 0.25
box_detail_head: true
box_detail_levels: [0, 1]
box_detail_scale: 0.25
box_detail_kernel: 3
box_detail_gate: true
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, LocalDetailRepC2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, LocalDetailRepC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, RepC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, RepC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, LocalDetailRepC2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, LocalDetailRepC2f, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, LocalDetailRepC2f, [256]]

  - [[18, 21], 1, Detect, [nc]]
