# YOLOv8 Varroa ablation: RepC2f + EnSimAM + WeightedAdd BiFPN neck + ASF + KVCA before P2/P3/P4/P5 Detect.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, RepC2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, RepC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, RepC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, RepC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, EnSimAM, []]

head:
  - [10, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [6, 1, Conv, [512, 1, 1]]
  - [[12, 13], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [512]]

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [4, 1, Conv, [256, 1, 1]]
  - [[17, 18], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [256]]

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [2, 1, Conv, [128, 1, 1]]
  - [[22, 23], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [128]]          # 25-P2 output

  - [-1, 1, Conv, [256, 3, 2]]
  - [[26, 20], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [256]]          # 28-P3 output

  - [-1, 1, Conv, [512, 3, 2]]
  - [[29, 15], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [512]]          # 31-P4 output

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[32, 10], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [1024]]         # 34-P5 output

  - [25, 1, ASFAttention, []]
  - [28, 1, ASFAttention, []]
  - [31, 1, ASFAttention, []]
  - [34, 1, ASFAttention, []]

  - [35, 1, KVCompressedAttention, [128, 4, 8, dwconv]]
  - [36, 1, KVCompressedAttention, [256, 4, 4, dwconv]]
  - [37, 1, KVCompressedAttention, [512, 4, 2, dwconv]]
  - [38, 1, KVCompressedAttention, [1024, 4, 2, dwconv]]

  - [[39, 40, 41, 42], 1, Detect, [nc]]
