# YOLOv8 Varroa P2/P3 with LocalDetailRepC2f, loc assignment, DFL residual, and API.
# First-run loc assignment uses conservative extra-positive weight to avoid diluting TAL positives.

nc: 1
loc_assign: true
loc_assign_topk: 2
loc_assign_max_stride: 8.0
loc_assign_center_radius: 2.5
loc_assign_weight: 0.25
dfl_residual: true
dfl_residual_scale: 0.25
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, LocalDetailRepC2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, LocalDetailRepC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, RepC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, RepC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, LocalDetailRepC2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, LocalDetailRepC2f, [128]] # 18-P2/4
  # - [-1, 1, AdversarialPerturbationInjection, [0.005, 0.05, boxgrad, True]] # 19-P2 localization API

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, LocalDetailRepC2f, [256]] # 22-P3/8
  - [-1, 1, AdversarialPerturbationInjection, [0.005, 0.05, boxgrad, True]] # 23-P3 localization API

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, RepC2f, [1024]]

  - [[19, 23], 1, Detect, [nc]]
