# YOLOv8 Varroa P2/P3 with decoupled localization assignment.
# Cls assignment remains TAL; box/DFL loss gets extra local positives on P2/P3.

nc: 1
loc_assign: true
loc_assign_topk: 3
loc_assign_max_stride: 8.0
loc_assign_center_radius: 2.5
loc_assign_weight: 0.5
dgfe_rec_gain: 0.03
dgfe_spatial_gain: 0.10
dgfe_boundary_ring: 1.0
dgfe_inner_value: 0.3
dgfe_tiny_area: 4.0
dgfe_neg_pos_ratio: 3
dgfe_neg_gain: 0.25
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, PoolingEdgeRepC2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, PoolingEdgeRepC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, RepC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, RepC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [128]]
  - [-1, 1, FeatureDGFE, [8, 0.0156862, 10.0, 0.001, 1.0, 0.5]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, RepC2f, [1024]]

  - [[19, 22], 1, Detect, [nc]]
