# Placement A_sc_psa – "Head Gate (PSA partial) + Backbone Shortcut" (no ASF, no BiFPN)
# Giống Placement A_sc nhưng dùng KVCompressedAttentionPartial (PSA-style) tại P2/P3:
#   - Chỉ áp dụng KVCA lên nửa channel (C//2), nửa còn lại bypass.
#   - Giảm ~50% compute của attention tại P2 (160×160) và P3 (80×80).
#   - out_proj trộn lại 2 nửa.
# Hypothesis: partial attention tại resolution cao giảm overfitting,
#   bypass half giữ nguyên local texture → tốt cho box regression.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, RepC2f, [256, True]]     # 4-P3/8  ← shortcut source
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, RepC2f, [512, True]]     # 6-P4/16 ← shortcut source
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, RepC2f, [1024, True]]    # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]         # 9-P5/32

head:
  # Top-down path: P5 → P4 → P3 → P2
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 10: P5 up
  - [[-1, 6], 1, Concat, [1]]                  # 11: cat P4 backbone
  - [-1, 3, RepC2f, [512, False]]              # 12-P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 13: P4 up
  - [[-1, 4], 1, Concat, [1]]                  # 14: cat P3 backbone
  - [-1, 3, RepC2f, [256, False]]              # 15-P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 16: P3 up
  - [[-1, 2], 1, Concat, [1]]                  # 17: cat P2 backbone
  - [-1, 3, RepC2f, [128, False]]              # 18-P2 output (top-down)

  # Bottom-up path with backbone shortcuts at P3 and P4
  - [-1, 1, Conv, [128, 3, 2]]                 # 19: P2 down
  - [[-1, 15, 4], 1, Concat, [1]]              # 20: P3_top + P2_down + P3_backbone (3-way)
  - [-1, 3, RepC2f, [256, False]]              # 21-P3 output

  - [-1, 1, Conv, [256, 3, 2]]                 # 22: P3 down
  - [[-1, 12, 6], 1, Concat, [1]]              # 23: P4_top + P3_down + P4_backbone (3-way)
  - [-1, 3, RepC2f, [512, False]]              # 24-P4 output

  - [-1, 1, Conv, [512, 3, 2]]                 # 25: P4 down
  - [[-1, 9], 1, Concat, [1]]                  # 26: cat P5 backbone
  - [-1, 3, RepC2f, [1024, False]]             # 27-P5 output

  # PSA-style partial KVCA gate at P2 and P3 (half channels through attention)
  - [18, 1, KVCompressedAttentionPartial, [128, 4, 8, dwconv, 0.1]]   # 28-P2 partial gate
  - [21, 1, KVCompressedAttentionPartial, [256, 4, 4, dwconv, 0.1]]   # 29-P3 partial gate

  - [[28, 29, 24, 27], 1, Detect, [nc]]
