# YOLOv8 Varroa baseline+P3 pooling edge+API, P3-only Detect without P5.
# Tests whether P5 semantic context is unnecessary; applies API before pooling-edge refinement.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, PoolingEdgeRepC2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, PoolingEdgeRepC2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, RepC2f, [512, True]]    # 6-P4/16

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]] # 9-P3/8

  - [9, 1, AdversarialPerturbationInjection, [0.005, 0.05, boxgrad]] # 10-P3 localization API
  - [-1, 1, PoolingEdgeRepC2f, [256]] # 11-P3 pooling-edge refinement

  - [[11], 1, Detect, [nc]]
