# YOLOv8 Varroa full backbone/PAN + P3 SR-DGFE, P2/P3 Detect, no API.
# Keeps P4/P5/SPPF/PAN for context, Detect uses final P2 and P3.

nc: 1
dgfe_rec_gain: 0.01
dgfe_spatial_gain: 0.20
dgfe_boundary_ring: 2.0
dgfe_inner_value: 0.2
dgfe_tiny_area: 64.0
dgfe_neg_pos_ratio: 3
dgfe_neg_gain: 0.25
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, PoolingEdgeRepC2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, PoolingEdgeRepC2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, RepC2f, [512, True]]    # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, RepC2f, [1024, True]]   # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]        # 9-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]          # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]] # 15-P3/8

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [128]] # 18-P2/4

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, PoolingEdgeRepC2f, [256]] # 21-P3/8
  - [-1, 1, FeatureDGFE, [8, 0.0156862, 10.0, 0.10, 1.0, 0.5, 3]] # 22-P3 SR-DGFE

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]          # 25-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, RepC2f, [1024]]         # 28-P5/32

  - [[18, 22], 1, Detect, [nc]]
