# Placement C – "TPH Full" (no ASF, no BiFPN)
# KVCompressedTransformerEncoder sau SPPF (P5 global context).
# Standard PAN neck: Upsample + Concat + RepC2f.
# KVCompressedTransformerEncoder (full: LN + KVCA + DW-FFN) tại P2 và P3 head.
# Hypothesis: full encoder richer feature → better box quality (mAP@50-95).

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, RepC2f, [256, True]]     # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, RepC2f, [512, True]]     # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, RepC2f, [1024, True]]    # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]         # 9-P5/32
  - [-1, 1, KVCompressedTransformerEncoder, [1024, 4, 2, dwconv, 0.1]]  # 10-P5 global ctx

head:
  # Top-down path: P5 → P4 → P3 → P2
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 11: P5 up (from KVEncoder)
  - [[-1, 6], 1, Concat, [1]]                  # 12: cat P4 backbone
  - [-1, 3, RepC2f, [512, False]]              # 13-P4 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 14: P4 up
  - [[-1, 4], 1, Concat, [1]]                  # 15: cat P3 backbone
  - [-1, 3, RepC2f, [256, False]]              # 16-P3 top-down

  - [-1, 1, nn.Upsample, [None, 2, nearest]]   # 17: P3 up
  - [[-1, 2], 1, Concat, [1]]                  # 18: cat P2 backbone
  - [-1, 3, RepC2f, [128, False]]              # 19-P2 output (top-down)

  # Bottom-up path: P2 → P3 → P4 → P5
  - [-1, 1, Conv, [128, 3, 2]]                 # 20: P2 down
  - [[-1, 16], 1, Concat, [1]]                 # 21: cat P3 top-down
  - [-1, 3, RepC2f, [256, False]]              # 22-P3 output

  - [-1, 1, Conv, [256, 3, 2]]                 # 23: P3 down
  - [[-1, 13], 1, Concat, [1]]                 # 24: cat P4 top-down
  - [-1, 3, RepC2f, [512, False]]              # 25-P4 output

  - [-1, 1, Conv, [512, 3, 2]]                 # 26: P4 down
  - [[-1, 10], 1, Concat, [1]]                 # 27: cat P5 KVEncoder output
  - [-1, 3, RepC2f, [1024, False]]             # 28-P5 output

  # Full encoder at P2 and P3 (LN + KVCA + DW-FFN)
  - [19, 1, KVCompressedTransformerEncoder, [128, 4, 8, dwconv, 0.1]]   # 29-P2 encoder
  - [22, 1, KVCompressedTransformerEncoder, [256, 4, 4, dwconv, 0.1]]   # 30-P3 encoder

  - [[29, 30, 25, 28], 1, Detect, [nc]]
