# Tiny YOLOv8 Varroa localization probe: P3/P4/P5 detector with one P3 KVCA block.

nc: 1
scale: t
scales:
  t: [0.25, 0.125, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C2f, [128, True]]       # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 3, C2f, [256, True]]       # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 3, C2f, [512, True]]       # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C2f, [1024, True]]      # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]        # 9-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f, [512]]             # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]             # 15-P3/8
  - [-1, 1, KVCompressedAttention, [256, 4, 4, dwconv]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C2f, [512]]             # 19-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C2f, [1024]]            # 22-P5/32

  - [[16, 19, 22], 1, Detect, [nc]]
