# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv5-style Varroa detector with P2-P5 outputs, SPPF-level KVCA,
# CBAM-enhanced C3 neck fusion, and KVCA prediction-head refinements.

nc: 1
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3, [128]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3, [256]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 9, C3, [512]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3, [1024]] # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]] # 9-P5/32
  - [-1, 1, KVCompressedAttention, [1024, 4, 2, dwconv]] # 10-P5/32

head:
  # Top-down FPN path.
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3CBAM, [512, False]] # 14-P4/16

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3CBAM, [256, False]] # 18-P3/8

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, C3CBAM, [128, False]] # 22-P2/4

  # Bottom-up PAN path.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P3
  - [-1, 3, C3CBAM, [256, False]] # 25-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3CBAM, [512, False]] # 28-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3CBAM, [1024, False]] # 31-P5/32

  # Transformer Prediction Head-style KVCA refinements before Detect.
  - [22, 1, KVCompressedAttention, [128, 4, 8, dwconv]]
  - [25, 1, KVCompressedAttention, [256, 4, 4, dwconv]]
  - [28, 1, KVCompressedAttention, [512, 4, 2, dwconv]]
  - [31, 1, KVCompressedAttention, [1024, 4, 2, dwconv]]

  - [[32, 33, 34, 35], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
