# YOLOv8n Varroa placement ablation: ASF + fixed-width BiFPN + P2/P3 EnSimAM + KVCA before P2/P3 Detect heads.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, RepC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, RepC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, RepC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [2, 1, Conv, [256, 1, 1]]
  - [4, 1, Conv, [256, 1, 1]]
  - [6, 1, Conv, [256, 1, 1]]
  - [9, 1, Conv, [256, 1, 1]]

  - [[11, 12, 13], 1, ScalSeq, [256]]
  - [-1, 1, ASFAttention, []]

  - [13, 1, ConvTranspose, [256, 2, 2]]
  - [[12, 16], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [256]]
  - [-1, 1, ConvTranspose, [256, 2, 2]]
  - [[15, 19], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [256]]
  - [-1, 1, EnSimAM, []]
  - [-1, 1, ConvTranspose, [256, 2, 2]]
  - [[10, 23], 1, WeightedAdd, [2]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, EnSimAM, []]            # 26-P2 output

  - [-1, 1, Conv, [256, 3, 2]]
  - [[15, 22, 27], 1, WeightedAdd, [3]]
  - [-1, 3, RepC2f, [256]]
  - [-1, 1, EnSimAM, []]            # 30-P3 output
  - [-1, 1, Conv, [256, 3, 2]]
  - [[12, 20, 31], 1, WeightedAdd, [3]]
  - [-1, 3, RepC2f, [256]]          # 33-P4 output
  - [-1, 1, Conv, [256, 3, 2]]
  - [[13, 34], 1, WeightedAdd, [2]]
  - [-1, 3, RepC2f, [256]]          # 36-P5 output

  - [26, 1, KVCompressedAttention, [256, 4, 8, dwconv]]
  - [30, 1, KVCompressedAttention, [256, 4, 4, dwconv]]

  - [[37, 38, 33, 36], 1, Detect, [nc]]
