# YOLOv8 Varroa ablation: RepC2f + EnSimAM + concat neck + ASF + KVCA before P2/P3/P4/P5 Detect.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, RepC2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, RepC2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, RepC2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, RepC2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, EnSimAM, []]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]          # 13-P4/16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, RepC2f, [256]]          # 16-P3/8

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, RepC2f, [128]]          # 19-P2/4

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC2f, [256]]          # 22-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, RepC2f, [512]]          # 25-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, RepC2f, [1024]]         # 28-P5/32

  - [19, 1, ASFAttention, []]
  - [22, 1, ASFAttention, []]
  - [25, 1, ASFAttention, []]
  - [28, 1, ASFAttention, []]

  - [29, 1, KVCompressedAttention, [128, 4, 8, dwconv]]
  - [30, 1, KVCompressedAttention, [256, 4, 4, dwconv]]
  - [31, 1, KVCompressedAttention, [512, 4, 2, dwconv]]
  - [32, 1, KVCompressedAttention, [1024, 4, 2, dwconv]]

  - [[33, 34, 35, 36], 1, Detect, [nc]]
