# YOLOv8 Varroa TPH-style config: SPPF-level KVCA global context,
# CBAM-enhanced PAN fusion, and KVCA prediction heads for P2/P3/P4/P5.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8-P5/32
  - [-1, 1, SPPF, [1024, 5]]        # 9-P5/32
  - [-1, 1, KVCompressedAttention, [1024, 4, 2, dwconv]]  # 10-P5/32

head:
  # Top-down PAN path with CBAM-refined fusion blocks.
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [512, False]]  # 13-P4/16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [256, False]]  # 16-P3/8

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [128, False]]  # 19-P2/4

  # Bottom-up PAN path.
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [256, False]]  # 22-P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [512, False]]  # 25-P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2fCBAM, [1024, False]] # 28-P5/32

  # Transformer Prediction Head-style KVCA refinements before Detect.
  - [19, 1, KVCompressedAttention, [128, 4, 8, dwconv]]
  - [22, 1, KVCompressedAttention, [256, 4, 4, dwconv]]
  - [25, 1, KVCompressedAttention, [512, 4, 2, dwconv]]
  - [28, 1, KVCompressedAttention, [1024, 4, 2, dwconv]]

  - [[29, 30, 31, 32], 1, Detect, [nc]]
