# YOLOv8 Varroa ablation with P2 detection and BRALite attention on P3/P4.
# P2 keeps high-resolution localization; RegionRoutingAttentionLite is applied
# only to P3/P4 to add context without paying the high P2 attention cost.

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]        # 9-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]             # 12-P4/16 neck

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]             # 15-P3/8 neck

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]             # 18-P2/4 xsmall

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]             # 21-P3/8 small

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]             # 24-P4/16 medium

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]            # 27-P5/32 large

  # Refine final P3/P4 neck outputs with BRALite. Keep P2 untouched for speed.
  - [21, 1, RegionRoutingAttentionLite, [256, 4, 10, 4]]  # 28-P3/8 BRALite
  - [24, 1, RegionRoutingAttentionLite, [512, 4, 10, 4]]  # 29-P4/16 BRALite

  - [[18, 28, 29, 27], 1, Detect, [nc]]
